# Super users

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

A company defines its super users as those who have made at least two
transactions. From the following table, write a query to return, for each
user, the date when they become a super user, ordered by oldest super users first. Users who are not super users should also be present in the table.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left} 
</style>

## The `users` table

In [3]:
%%sql

DROP TABLE IF EXISTS users;
CREATE TABLE users (
    user_id INT,
    product_id INT,
    transaction_date DATE
);

INSERT INTO users
VALUES
    (1, 101, '2-12-20'), 
    (2, 105, '2-13-20'), 
    (1, 111, '2-14-20'), 
    (3, 121, '2-15-20'), 
    (1, 101, '2-16-20'), 
    (2, 105, '2-17-20'),
    (4, 101, '2-16-20'), 
    (3, 105, '2-15-20');

SELECT * FROM users;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
8 rows affected.
8 rows affected.

[(1, 101, datetime.date(2020, 2, 12)),
 (2, 105, datetime.date(2020, 2, 13)),
 (1, 111, datetime.date(2020, 2, 14)),
 (3, 121, datetime.date(2020, 2, 15)),
 (1, 101, datetime.date(2020, 2, 16)),
 (2, 105, datetime.date(2020, 2, 17)),
 (4, 101, datetime.date(2020, 2, 16)),
 (3, 105, datetime.date(2020, 2, 15))]

## The expected output

| user_id | superuser_date |
|-------- |--------------- |
| 1       | 02-14-20       |
| 3       | 02-15-20       |
| 2       | 02-17-20       |
| 4       | NULL           |

# Type your SQL below

In [4]:
# %% sql
#
# Type your query here